document.write(
  "<p>" +
    `1. Дані два масиви: ['a', 'b', 'c'] та [1, 2, 3]. Об'єднайте їх разом`
);

const a = ["a", "b", "c"];
const b = [1, 2, 3];

let c = a.concat(b);

document.write("<p>" + `Рішення :` + " " + `[${c.join(", ")}]`);

document.write("<hr/>");
// --------------------------------------------------------------------------------------------------

document.write(
  "<p>" + `2. Дан масив ['a', 'b', 'c']. Додайте йому до кінця елементи 1, 2, 3`
);

const a1 = ["a", "b", "c"];

let n = a1.push(1, 2, 3);

document.write("<p>" + `Рішення :` + " " + `[${a1.join(", ")}]`);

document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write(
  "<p>" + `3. Дан масив [1, 2, 3]. Зробіть із нього масив [3, 2, 1]`
);

const d = [1, 2, 3];

d.reverse();

document.write("<p>" + `Рішення :` + " " + `[${d.join(", ")}]`);

document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write(
  "<p>" + `4. Дан масив [1, 2, 3]. Додайте йому до кінця елементи 4, 5, 6`
);

const f = [1, 2, 3];

f.push(4, 5, 6);

document.write("<p>" + `Рішення :` + " " +`[${f.join(", ")}]`);
document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write ("<p>" + `5. Дан масив [1, 2, 3]. Додайте йому на початок елементи 4, 5, 6.`);

const m = [1, 2, 3];

m.unshift(4, 5, 6);

document.write("<p>" + `Рішення :` + " " +`[${m.join(", ")}]`);

document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write("<p>" + `6. Дан масив ['js', 'css', 'jq']. Виведіть перший елемент на екран.`);

const arr = ['js', 'css', 'jq'];

document.write("<p>" + `Рішення :` + " " + `'${arr[0]}'`);

document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write("<p>" + `7. Дан масив [1, 2, 3, 4, 5]. За допомогою методу slice запишіть нові елементи [1, 2, 3].`);

const j = [1, 2, 3, 4, 5];

let j1 = j.slice (0, 3);

document.write("<p>" + `Рішення :` + " " + `[${j1.join(", ")}]`);

document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write("<p>" + `8. Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 4, 5].`);

j.splice (1, 2);

document.write("<p>" + `Рішення :` + " " + `[${j.join(", ")}]`);

document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write("<p>" + `9. Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 2, 10, 3, 4, 5].`);

const q = [1, 2, 3, 4, 5];

q.splice (2, 0, 10);

document.write("<p>" + `Рішення :` + " " + `[${q.join(", ")}]`);

document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write("<p>" + `10. Дан масив [3, 4, 1, 2, 7]. Відсортуйте його.`);

const num = [3, 4, 1, 2, 7];

num.sort();

document.write("<p>" + `Рішення :` + " " + `[${num.join(", ")}]`);

document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write("<p>" + `11. Дан масив з елементами 'Привіт,', 'світ', і '!'. Потрібно вивести на екран фразу 'Привіт, світ!'.`);

const str = ['Привіт,', 'світ', '!'];

let str1 = str[0];
let str2 = str[1] + str[2];

document.write("<p>" + `Рішення :` + " " + str1 + " " + str2);

document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write("<p>" + `12. Дан масив ['Привіт,', 'світ', '!']. Необхідно записати в нульовий елемент цього масиву слово 'Поки, '
(тобто замість слова 'Привіт,' буде 'Поки,'`);

str[0] = 'Поки,';

let str3 = str[0];

document.write("<p>" + `Рішення :` + " " + str3 + " " + str2);

document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write("<p>" + `13. Створіть масив arr з елементами 1, 2, 3, 4, 5 двома різними способами.`);

const arrN = [1, 2, 3, 4, 5];
const arrM = new Array(1, 2, 3, 4, 5);

document.write("<p>" + `Рішення :` + " " + "<br/>" + `спосіб 1 : [${arrN.join(", ")}]`);
document.write("<p>" +  " " + `спосіб 2 : [${arrM.join(", ")}]`);

document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write("<p>" + `14. Дан багатовимірний масив arr:
<pre>
<code>
    var arr = {
        'ru':['блакитний', 'червоний', 'зелений'],
        'en':['blue', 'red', 'green'],
    };
</code>
</pre>
 Виведіть за його допомогою слово 'блакитний' 'blue'`);

 var arrB = {
    'ru':['блакитний', 'червоний', 'зелений'],
    'en':['blue', 'red', 'green'],
};
const ru = arrB.ru;
const en = arrB.en;

console.log(ru[0], en[0]);

document.write("<p>" + `Рішення :` + " " + `'${ru[0]}'` + " " + `'${en[0]}'`);

document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write("<p>" + `15. Створіть масив arr = ['a', 'b', 'c', 'd'] і за допомогою його виведіть на екран рядок 'a+b, c+d'.`)

const arrC = ['a', 'b', 'c', 'd'];

let arr1 = arrC.slice(0, 2).join("+").toString();
let arr2 = arrC.slice(2, 4).join("+").toString();

console.log(arr1, arr2);

document.write("<p>" + `Рішення :` + " " + `'${arr1}, ${arr2}'`);

document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write(
  "<p>" +
    `16. Запитайте у користувача кількість елементів масиву. Виходячи з даних, які ввів користувач
 створіть масив на ту кількість елементів, яку передав користувач.
у кожному індексі масиву зберігайте число яке показуватиме номер елемента масиву.`
);

let arrD = new Array(
  parseInt(prompt("Введите количество элементов массива 0-10", "3"))
);

const arrNum = [];

for (let i = 0; i < arrD.length; i++) {
  arrNum.push(i);
}

document.write("<p>" + `Рішення :` + " " + `[${arrNum.join(", ")}]`);

document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write(
  "<p>" +
    `17. Зробіть так, щоб з масиву, який ви створили вище, вивелися всі непарні числа в параграфі, 
а парні в спані з червоним тлом.`
);

document.write("<p>" + `Рішення :`);

let arrNum1 = arrNum;

for (let i = 0; i < arrNum1.length; i++) {
  if (i % 2 === 0) {
    document.write("<p>" + `<span style='background-color:red;'>${i}</span>`);
  } else {
    document.write("<p>" + i);
  }
}
document.write("<hr/>");

// --------------------------------------------------------------------------------------------------

document.write(
  "<p>" +
    `18. Напишіть код, який перетворює та об'єднує всі елементи масиву в одне рядкове значення. Елементи масиву будуть розділені комою.
           <pre>
               <code>
                var vegetables = ['Капуста', 'Ріпа', 'Редиска', 'Морквина'];
    
                <span class="green">// Ваш код</span>

                document.write(str1); // "Капуста, Ріпа, Редиска, Морквина"
               </code>
           </pre> `
);

var vegetables = ['Капуста', 'Ріпа', 'Редиска', 'Морквина'];


let str4 = vegetables.join(", ").toString();

document.write("<p>" + `Рішення :` + " " + `"${str4}"`);

document.write("<hr/>");
